# Employees Salary Analysis

In [1]:
import pandas as pd
salary = pd.read_csv("employee_salary.csv")
salary.head()

,Name,Age,Gender,Department,Job_Title,Experience,Yearly_Salary(USD)
0,Olivia Kim,30,M,Marketing,Director,29,103353
1,Benjamin Lopez,21,M,HR,Specialist,10,146922
2,Luna Gurung,37,F,Finance,Specialist,30,110759
3,Ibrahim Ramirez,34,F,Marketing,Director,21,68422
4,Luna Rodriguez,30,F,Sales,Consultant,8,100159

In [2]:
# Average salary by department
salary_by_department = round((salary.groupby("Department")["Yearly_Salary(USD)"].mean()), 2)
salary_by_department

Department
Engineering    98508.76
Finance        95637.53
HR             84259.96
IT             95825.64
Marketing      92102.17
Operations     91828.61
Sales          94588.61
Name: Yearly_Salary(USD), dtype: float64

In [3]:
highest = salary["Yearly_Salary(USD)"].idxmax()
print(f"The highest paying job is {salary.loc[highest, "Job_Title"]} from the {salary.loc[highest, "Department"]} department")

The highest paying job is Specialist from the Sales department

In [4]:
lowest = salary["Yearly_Salary(USD)"].idxmin()
print(f"The lowest paying job is {salary.loc[lowest, "Job_Title"]} from the {salary.loc[lowest, "Department"]} department")

The lowest paying job is Engineer from the IT department

In [6]:
# Average salary by gender
genders = round((salary.groupby("Gender")["Yearly_Salary(USD)"].mean()), 2)
genders

Gender
F    92499.26
M    94326.87
Name: Yearly_Salary(USD), dtype: float64

In [12]:
total_salary = salary["Yearly_Salary(USD)"].sum()
print(f"The company spends {total_salary}$ per year on salaries")

The company spends 37372537$ per year on salaries